-- 셀프체크
-- 5장에서 만든 orders(주문) 테이블을 이용해 다음 1~5를 수행하는 쿼리를 작성하세요.

use store;

	-- (1, '생돌김 50매', 5387.75, 1, '2024-10-24 01:19:44'),
	-- (2, '그릭 요거트 400g, 2개', 7182.25, 2, '2024-10-24 01:19:44'),
	-- (3, '냉장 닭다리살 500g', 6174.50, 1, '2024-10-24 01:19:44'),
	-- (4, '냉장 고추장 제육 1kg', 9765.00, 1, '2024-10-24 01:19:44'),
	-- (5, '결명자차 8g * 18티백', 4092.25, 1, '2024-10-24 01:19:44'),
	-- (6, '올리브 오일 1l', 17990.00, 1, '2024-11-06 22:52:33'),
	-- (7, '두유 950ml, 20개', 35900.12, 1, '2024-11-06 22:52:33'),
	-- (8, '카카오 닙스 1kg', 12674.50, 1, '2024-11-06 22:52:33'),
	-- (9, '손질 삼치살 600g', 9324.75, 1, '2024-11-16 14:55:23'),
	-- (10, '자숙 바지락 260g', 6282.00, 1, '2024-11-16 14:55:23'),
	-- (11, '크리스피 핫도그 400g', 7787.50, 2, '2024-11-16 14:55:23'),
	-- (12, '우유 900ml', 4360.00, 2, '2024-11-16 14:55:23'),
	-- (13, '모둠 해물 800g', 4770.15, 1, '2024-11-28 11:12:09'),
	-- (14, '토마토 케첩 800g', 3120.33, 3, '2024-11-28 11:12:09'),
	-- (15, '계란 30구', 8490.00, 2, '2024-12-11 12:34:56'),
	-- (16, '해물 모듬 5팩 묶음 400g', 9800.50, 4, '2024-12-11 12:34:56'),
	-- (17, '칵테일 새우 900g', 22240.20, 1, '2024-12-11 12:34:56'),
	-- (18, '토마토 케첩 1.43kg', 7680.25, 1, '2024-12-11 12:34:56'),
	-- (19, '국내산 양파 3kg', 5192.00, 1, '2024-12-11 12:34:56'),
	-- (20, '국내산 깐마늘 1kg', 9520.25, 1, '2024-12-11 12:34:56');

-- 1. 상품명이 '국내산'으로 시작하는 주문의 개수를 구하세요.
SELECT COUNT(*) FROM orders WHERE name LIKE '국내산%';

-- 2. 주문 수량이 2~4개인 상품의 평균 가격을 구하세요.
SELECT AVG(price) FROM orders WHERE quantity >= 2 and quantity <=4;
-- 3. 11월 주문 중 11월 20일 이후에 들어온 주문의 개수를 구하세요.
SELECT COUNT(*) FROM orders WHERE MONTH(created_at) ='11' AND DAY(created_at) > 20 ; 
-- 4. 상품명에 부피 단위인 'ml' 또는 'l'가 포함된 주문을 모두 조회하세요.
SELECT * FROM orders WHERE name LIKE '%ml%' OR name LIKE '%l%';
-- 5. 10월과 12월에 들어온 주문의 개수를 구하세요(주의: 11월은 포함하지 않습니다).
SELECT COUNT(*) FROM orders WHERE MONTH(created_at) IN ('10','12');



